/* Практика: Напиши программу, которая хранит баланс пользователя. В цикле запрашивай действие: 1 — проверить баланс, 2 — пополнить, 3 — снять, 4 — выход. Храни историю операций в List.
Самопроверка: Программа не должна уходить в бесконечный цикл при неверном вводе и не должна позволять уходить в минус.
*/
void main() {
    int step = 1;
    int 
    List<String> History = [];
    while(step==1){

    }
}

void UserInterface(){
    Roles();
    int iteration = int.parse(stdin.readLineSync()!);
    Iteration(iteration);
}

void Iteration(i) {
    if
}

void Roles() {
    print("действие: 1 — проверить баланс, 2 — пополнить, 3 — снять, 4 — выход.");
}